---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.GroupFailures.BadViewForAttachedGroupWarn
source: html/5fc76ce1-fae5-b2fc-60c1-7b2f4bc53670.htm
---
# Autodesk.Revit.DB.BuiltInFailures.GroupFailures.BadViewForAttachedGroupWarn Property

Attached groups can only be created for view specific elements belonging to non-3d model views.

## Syntax (C#)
```csharp
public static FailureDefinitionId BadViewForAttachedGroupWarn { get; }
```